//Cтворюємо функцію яка буде йти по массиву з кінця та прибирати за собою индекса.Це зроблено для того щоб не збити порядок рахування индексу і щоб було корректно знайдено потрібне число для видалення
// вказуємо аргументи  для  функції 
function removeElement ( array, item){
    // робимо перевірку елемента з індексом
    for( let i = array.length -1; i >= 0; i--){
      if(array[i] === item){
        array.splice(i,1)// видаляємо елемент 1 в індексі
      }
    }
};
// ми видаляємо потрібний елемент за тобой методу .splice().Елемент який буде віднайденний в циклі for 
const array = [1, 2, 5, 3, '5', 4, 5, 6, '7']; 
// викликаємо функцію removeElement для видалення всіх 5 з масиву
removeElement(array, 5);
debugger
console.log(array);
// виводимо в консолі масив з 7 индексів